[
  {
    "step_id": "FIR_FIR_MUST_BE_RECORDED_IN_AC",
    "procedure": "FIR\n● FIR must be recorded in accordance with the provisions of Sec\n173 of BNSS earlier Sec. 154 of Cr.P.C.\n● FIR shall be recorded by a woman police officer or any woman\nofficer.\n● FIR, being an impo",
    "details": "FIR\n● FIR must be recorded in accordance with the provisions of Sec\n173 of BNSS earlier Sec. 154 of Cr.P.C.\n● FIR shall be recorded by a woman police officer or any woman\nofficer.\n● FIR, being an important document, should be drawn up with\ngreatest care and caution, incorporating all material\ninformation/facts which are directly or indirectly connected with\nthe crime or are likely to form important evidence.\n● The victim can lodge the FIR in any police station in any State or\nDistrict. Subsequently, it can be transferred to the concerned State\nor police station having jurisdiction for investigation.\nAudio-Visual and electronic means, including scanning, can be\nused to transmit the information at the earliest.\n● A copy of such Information as recorded under sub-section (1) of\nsection 173 of BNSS earlier section 154 of Cr.P.C. shall be given\nforthwith, free of cost, to the victim or informant.\n● If there is any delay in recording of such FIR, the reasons for such\ndelay should be explained in the FIR.\n● FIR should be recorded in the regional language, if required, to\nmake it easier for the survivor.\n● As rape cases are Grave/Special Report Cases, investigation shall\nbe monitored by the DCP of the District concerned. Initial",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "FIR"
  },
  {
    "step_id": "TREATMENT_OF_VICTIM_THE_VICTIM",
    "procedure": "Treatment of victim\n● The victim of such crime should be treated with honor and\nsensitivity.\n● Officer interacting with her (victim) should be extremely\ncourteous. No indecent questions should be put ",
    "details": "Treatment of victim\n● The victim of such crime should be treated with honor and\nsensitivity.\n● Officer interacting with her (victim) should be extremely\ncourteous. No indecent questions should be put to the victim.\nCare should be taken to protect dignity and prevent embarrassing\nsituation to the victim.\n● In case, the victim is not accompanied by any member of her\nfamily, the information about such crime should be given\nimmediately to her family.\n● The identity of the victim should not be made public and due care\nshould be taken not to reveal her identity in print and electronic\nmedia. Similar care has to be taken for juveniles and children in\nconflict with law. However, name and photo of such victim may\nbe used in the case diary for the purpose of re-investigation.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "WHERE_THE_VICTIM_IS_TEMPORARIL",
    "procedure": "Where the victim is temporarily or permanently, mentally or\nphysically disabled\n● If the person against whom an offence is alleged to have been\ncommitted or attempted, is temporarily or permanently, m",
    "details": "Where the victim is temporarily or permanently, mentally or\nphysically disabled\n● If the person against whom an offence is alleged to have been\ncommitted or attempted, is temporarily or permanently, mentally\nor physically, disabled, such information shall be recorded, at the\nresidence of the person seeking to report such offence or at a\nconvenient place of such person’s choice, in the presence of an\ninterpreter or a special educator, as the case may be.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Legal/Statement"
  },
  {
    "step_id": "IF_VICTIM_IS_OF_DIFFERENT_LING",
    "procedure": "If victim is of different linguistic background\n● In case, the victim is of a different linguistic background,\nstatement/FIR must be recorded. An interpreter for the victim\nwith different linguistic b",
    "details": "If victim is of different linguistic background\n● In case, the victim is of a different linguistic background,\nstatement/FIR must be recorded. An interpreter for the victim\nwith different linguistic background may be provided, during\ninvestigation, for recording of statement / FIR.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "FIR"
  },
  {
    "step_id": "IF_VICTIM_IS_A_MINOR_IN_CASE_W",
    "procedure": "If victim is a minor\n● In case, where the victim is a minor, consent and presence of\nparents may be taken at the time of recording of her statement or\nFIR. If the guardian is not available, consent an",
    "details": "If victim is a minor\n● In case, where the victim is a minor, consent and presence of\nparents may be taken at the time of recording of her statement or\nFIR. If the guardian is not available, consent and presence of a\nrepresentative of an NGO or a member of the Child Welfare\nCommittee may be taken during recording of the statement or\nFIR.\n● I.O. shall wear plain clothes during interview/investigation (as per\nSection-24(2), POCSO Act )\n● The Police Officer, while examining the child, shall ensure that at\nno point of time, the child comes in contact with the accused, in\nany manner, whatsoever (as per the mandate of Section- 24(3) &\n36, POCSO Act r/w Section- 308 of BNSS earlier 273 of\nCr.P.C.)\n● Where, the Special Juvenile Police Unit or the local police is\nnotified and circumstances warrant, that the child against whom\nan offence has been committed, is in need of care and protection,\nit shall, after recording the reasons in writing, make immediate\narrangement, to give him/her such care and protection, including\nadmitting the child into a shelter home or to the nearest hospital,\nwithin twenty-four hours of the report, as may be prescribed, as\nwell as carry on investigation to find the legal guardian of the\nvictim, in appropriate cases, as per the facts of the case\n● The Police Officer shall not detain any child at night in the police\nstation for any reason (as per the requirement of Section-24(4),\nPOCSO Act).\n● If the victim is a minor and happens to be a victim of incest, s/he",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "FIR"
  },
  {
    "step_id": "COMPLIANCE_OF_SECTION_176_OF_B",
    "procedure": "Compliance of Section 176 of BNSS earlier 157 of Cr.P.C.\n● A copy of the FIR shall be sent immediately to the Magistrate\nunder section 176 of BNSS earlier 157 of Cr.P.C.",
    "details": "Compliance of Section 176 of BNSS earlier 157 of Cr.P.C.\n● A copy of the FIR shall be sent immediately to the Magistrate\nunder section 176 of BNSS earlier 157 of Cr.P.C.",
    "legal_ref": null,
    "timeline_hours": 24,
    "source_doc": "BPR&D SOP",
    "category": "FIR"
  },
  {
    "step_id": "INVESTIGATION_INVESTIGATING_OF",
    "procedure": "Investigation\nInvestigating Officer\n● As far as possible, investigation of crime against women shall be\nconducted by a woman officer. Whenever necessary,\ninvestigation team should be formed, consistin",
    "details": "Investigation\nInvestigating Officer\n● As far as possible, investigation of crime against women shall be\nconducted by a woman officer. Whenever necessary,\ninvestigation team should be formed, consisting of three to four\nexperienced police personnel of whom one should be designated\nas the Chief I.O.\n● There should be, at least, one lady officer in the team. Rape case\nshould usually be investigated by a senior and experienced police\nofficer as far as possible, it being a grave offence.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "RECORDING_OF_STATEMENT_OF_VICT",
    "procedure": "Recording of statement of victim under section 180 of BNSS\nearlier 161,Cr.P.C.\n● While talking to the victim, her mental and emotional state should\nbe observed carefully. Proper account of the inciden",
    "details": "Recording of statement of victim under section 180 of BNSS\nearlier 161,Cr.P.C.\n● While talking to the victim, her mental and emotional state should\nbe observed carefully. Proper account of the incident should be\nrecorded in the language of the victim as early as possible.\n● The victim should not be called to the police station.\n● The IO should visit her home in plain clothes and take care to\nelicit information from the victim in such a manner that she\nremains calm and composed.\n● The statement of the victim should be recorded at the residence of\nthe victim or in the place of her choice by a woman police officer\nin the presence of parents or guardians or a near relative or a\nsocial worker of the locality.\n● In cases under POCSO Act, the presence of parents/guardians of",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Legal/Statement"
  },
  {
    "step_id": "STATEMENT_OF_VICTIM_UNDER_SECT",
    "procedure": "Statement of victim under section 183 of BNSS earlier 164,Cr.P.C.\n● It shall be the duty of investigating officer/SHO to inform the\nJudicial Magistrate for recording of statement of the person\nagainst",
    "details": "Statement of victim under section 183 of BNSS earlier 164,Cr.P.C.\n● It shall be the duty of investigating officer/SHO to inform the\nJudicial Magistrate for recording of statement of the person\nagainst whom such an offence has been committed, as soon as the\ncommission of offence is brought to the notice of the police (as\nmandated under sub-section (5-A) of Section 183 of BNSS earlier\n164,Cr.P.C.\n● The investigating officer shall take immediate steps to take the\nvictim to any metropolitan / preferably Judicial Magistrate for the\npurpose of recording her statement under section 183 of BNSS\nearlier 164, Cr.P.C.\n● A copy of the statement under section 183 of BNSS earlier\n164,Cr.P.C. should be handed over to the investigating officer\nimmediately with specific direction that the content of such\nstatement under section 183 of BNSS earlier 164,Cr.P.C. should\nnot be disclosed to any person till the charge sheet / report under",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Legal/Statement"
  },
  {
    "step_id": "DYING_DECLARATION_DYING_DECLAR",
    "procedure": "Dying declaration\n● Dying declaration may be recorded before a Magistrate or Doctor\nand, if not possible, it should be videographed under section-180\nof BNSS earlier 161,Cr.P.C.",
    "details": "Dying declaration\n● Dying declaration may be recorded before a Magistrate or Doctor\nand, if not possible, it should be videographed under section-180\nof BNSS earlier 161,Cr.P.C.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Medical"
  },
  {
    "step_id": "STATEMENT_OF_RELEVANT_AND_MATE",
    "procedure": "Statement of relevant and material witness under section 180 of\nBNSS earlier 161,Cr.P.C\n● All relevant and material witnesses shall be examined promptly.\nEspecially the witness, who reached the spot o",
    "details": "Statement of relevant and material witness under section 180 of\nBNSS earlier 161,Cr.P.C\n● All relevant and material witnesses shall be examined promptly.\nEspecially the witness, who reached the spot of the incident on\nhearing shouts of the victim, if any, must be examined.\n● In case, the victim is indisposed/unable to narrate the incident/or a\nminor who cannot comprehend or is in shock and the state of the",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Legal/Statement"
  },
  {
    "step_id": "BOND_FOR_PRESENCE_BEFORE_THE_C",
    "procedure": "Bond for presence before the court and giving evidence\n The I.O. shall require the complainant, if any, and so many of the\npersons who appear to such officer, to be acquainted with the\nfacts and circ",
    "details": "Bond for presence before the court and giving evidence\n The I.O. shall require the complainant, if any, and so many of the\npersons who appear to such officer, to be acquainted with the\nfacts and circumstances of the case, as he may think necessary to\nexecute a bond to appear before the magistrate as thereby directed\nand prosecute or give evidence, as the case may be, in the matter\nof charge against the accused (as per the mandate vide section\n190 of BNSS earlier 170 of the Cr.P.C.).",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Evidence Collection"
  },
  {
    "step_id": "MEDICAL_EXAMINATION_OF_VICTIM",
    "procedure": "Medical examination of victim\n● Section 184 of BNSS earlier 164(A), Cr.P.C. imposes an\nobligation on the part of investigating officer to get the victim of\nrape medically examined within 24 hours from",
    "details": "Medical examination of victim\n● Section 184 of BNSS earlier 164(A), Cr.P.C. imposes an\nobligation on the part of investigating officer to get the victim of\nrape medically examined within 24 hours from the time of\nreceiving the information relating to the commission of such\noffence.\n● The report of such medical examination should be immediately",
    "legal_ref": null,
    "timeline_hours": 24,
    "source_doc": "BPR&D SOP",
    "category": "Medical"
  },
  {
    "step_id": "PROOF_OF_AGE_IN_ALL_CASES_UNDE",
    "procedure": "Proof of age\nIn all cases under POCSO Act, where the age of the victim, and\ncases where the age of the child in conflict with law are material,\nthe following documents/procedure shall be relied upon (",
    "details": "Proof of age\nIn all cases under POCSO Act, where the age of the victim, and\ncases where the age of the child in conflict with law are material,\nthe following documents/procedure shall be relied upon (Section-34,\nPOCSO Act read along with Juvenile Justice (Care and\nProtection of Children) Act, 2000.)\n● (i) A date of birth certificate from the school, or matriculation or\nequivalent certificate from the concerned examination Board, if\navailable; and in the absence thereof,\n● (ii) Birth certificate given by a corporation or a municipal\nauthority or a Panchayat,\n● (iii) And only in the absence of (i) and (ii) above, age shall be\ndetermined by an ossification test or any other medically proven\nand improved age determination test.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Medical"
  },
  {
    "step_id": "COLLECTION_OF_EVIDENCE_SCENE_O",
    "procedure": "Collection of evidence\nScene of crime\n● Inspection and collection of valuable clues from the scene of",
    "details": "Collection of evidence\nScene of crime\n● Inspection and collection of valuable clues from the scene of",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Evidence Collection"
  },
  {
    "step_id": "ELECTRONIC_EVIDENCE_ELECTRONIC",
    "procedure": "Electronic evidence\n● Electronic evidence is available in many forms such as CCTV\nfootage, phone call details, etc., and it would be useful to collect\nall available electronic evidence. CCTV footage i",
    "details": "Electronic evidence\n● Electronic evidence is available in many forms such as CCTV\nfootage, phone call details, etc., and it would be useful to collect\nall available electronic evidence. CCTV footage is especially\nuseful and I.O. must collect all CCTV footages, whenever\navailable.\n● Focus should be on collecting primary evidence. Instead of the\nfootage alone, the hard disk and relevant memory disks should\nalso be collected. For reference on primary and secondary\nevidence, Section 58 of BSA earlier 63 of the Indian Evidence\nAct should be referred.\nProof of electronic evidence\n● Electronic evidence would need to be proven in the manner\nprescribed under section 63 of BSA earlier 65-B of the Indian\nEvidence Act.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Evidence Collection"
  },
  {
    "step_id": "ARREST_OF_THE_SUSPECT_ALL_EFFO",
    "procedure": "Arrest of the suspect\n● All efforts should be made to arrest the suspect of the crime\npromptly.\n● If the suspect has concealed himself or is absconding/evading\narrest the I.O. shall make a request to ",
    "details": "Arrest of the suspect\n● All efforts should be made to arrest the suspect of the crime\npromptly.\n● If the suspect has concealed himself or is absconding/evading\narrest the I.O. shall make a request to the court for issue of a\nwarrant of arrest of the suspect.\n● If the arrest warrant could not be executed because the person\nagainst whom the warrant has been issued has absconded, or is\nconcealing himself, the I.O. shall apply to the relevant court to\ndeclare the person a proclaimed offender and move for the\nattachment of the property of such person, according to section 84\nand 85 of BNSS earlier 82 and 83 of the Cr.P.C.\nComplaint for offence under section 209 of BNS earlier 174(A)\nIPC against absconder\nIf any person, against whom a proclamation under section 84 of\nBNSS earlier 82 of Cr.P.C. has been issued, fails to appear at the\nspecified place and the specified time as required by such\nproclamation, the I.O. should move the concerned court, for offence\nunder section 209 of BNS earlier 174(A) IPC.\nWhen suspect is not known to the victim\n● Description of accused should be ascertained from the victim and\na portrait of the suspect should be prepared immediately and\ncirculated.\n● A ‘look-out’ message of the accused should be flashed on the\nwireless.\n● Local secret/open enquiries should be conducted for the suspect.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "FIR"
  },
  {
    "step_id": "TEST_IDENTIFICATION_WHEN_AN_AC",
    "procedure": "Test identification\n● When an accused not known to the victim is arrested, he should\nbe sent to judicial custody after due interrogation and medical\nexamination, for Test Identification. The court sho",
    "details": "Test identification\n● When an accused not known to the victim is arrested, he should\nbe sent to judicial custody after due interrogation and medical\nexamination, for Test Identification. The court should be\nrequested to fix an early date for the identification proceedings.\n● It should be ensured that the face of the accused is covered while\nhe is being taken to the court for production.\n● If the person identifying the person arrested is mentally or\nphysically disabled, such process of identification shall take place\nunder the supervision of a judicial magistrate, who would take\nappropriate steps to ensure that the identifier, identifies the\naccused, using methods, the identifier is comfortable with.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Medical"
  },
  {
    "step_id": "BAIL_APPLICATION_BAIL_APPLICAT",
    "procedure": "Bail application\n● Bail application shall be opposed with relevant grounds by the\nprosecution.\n● If any bail application has been presented by the accused, or on\nbehalf of the accused, before the cour",
    "details": "Bail application\n● Bail application shall be opposed with relevant grounds by the\nprosecution.\n● If any bail application has been presented by the accused, or on\nbehalf of the accused, before the court, it shall be the duty of the\nconcerned Prosecutor/Investigating officer to inform the victim\nabout such application within appropriate time, in order to give\nher an opportunity to oppose such application, if she, so desires.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "WITNESS_PROTECTION_IN_ALL_CASE",
    "procedure": "Witness Protection\nIn all cases, care shall be taken that the victim and her family or any\nperson whom she is interested in, is not threatened or tempted in any\nmanner by the accused or any other pers",
    "details": "Witness Protection\nIn all cases, care shall be taken that the victim and her family or any\nperson whom she is interested in, is not threatened or tempted in any\nmanner by the accused or any other person.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "SUBMISSION_OF_CHARGE_SHEET_ALL",
    "procedure": "Submission of Charge sheet\n● All offences against women shall be promptly investigated and\ncharge sheets should be filed in the court of law within sixty days\nas per section 193 of BNSS earlier 173 Cr",
    "details": "Submission of Charge sheet\n● All offences against women shall be promptly investigated and\ncharge sheets should be filed in the court of law within sixty days\nas per section 193 of BNSS earlier 173 Cr.P.C.\n● At no point of time, the quality of investigation should be\ncompromised. All such cases, should be automatically supervised\nby an officer of the rank of Dy.SP, who should associate himself\nwith day to day investigation, including, arrest of the accused.\nOrders for charge sheet should be issued after due scrutiny to\nensure that the investigation and subsequent prosecution does not\nsuffer from any lacuna or omission.\n● The I.O./SHO shall ensure that all material documents such as\nmedical examination reports, FSL reports, Test Identification,\nrelevant daily diary/ Roznamchasanhas etc, are included with the\ncharge sheet",
    "legal_ref": null,
    "timeline_hours": 1440,
    "source_doc": "BPR&D SOP",
    "category": "Medical"
  },
  {
    "step_id": "DUTY_OF_IO_SHO_DURING_TRIAL_AN",
    "procedure": "Duty of IO/SHO during trial\n● An officer, not below the rank of sub-Inspector, ideally the I.O. of\nthe case, should be appointed as Holding I.O., to monitor the\nprogress of the trial of the case. He/S",
    "details": "Duty of IO/SHO during trial\n● An officer, not below the rank of sub-Inspector, ideally the I.O. of\nthe case, should be appointed as Holding I.O., to monitor the\nprogress of the trial of the case. He/She should submit a progress\nreport on each date of the trial which should be put up to\nsupervisory officers, including the SP.\n● It is the responsibility of the IO to ensure timely production of\nprosecution witnesses for briefing by the PP/APP. He shall also\nensure physical availability of all relevant records and material\nobjects, at the time of the trial.\n● Service of summons should be monitored to ensure presence of\nwitnesses. Whenever possible, summons should also be issued in\nthe e-format.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "REHABILITATION_OF_THE_VICTIM_R",
    "procedure": "Rehabilitation of the Victim\n● Rape victims need help in rehabilitation. Rehabilitation has to\ntake care of each of the four aspects of the victim’s state,\nincluding physical, mental, psychological an",
    "details": "Rehabilitation of the Victim\n● Rape victims need help in rehabilitation. Rehabilitation has to\ntake care of each of the four aspects of the victim’s state,\nincluding physical, mental, psychological and social. In case the\nvictim does not have place of abode, she should be shifted to a\nshelter home.\n● The victim is likely to suffer social stigma and possible alienation\nfrom the family. Necessary counseling to the victim and family\nmembers should be provided.\n● The victim is entitled to compensation under ‘Victim\ncompensation Schemes’ run by the State Governments. The\nvictim should be appraised of the provision of the relevant\nscheme for getting compensation.",
    "legal_ref": null,
    "timeline_hours": null,
    "source_doc": "BPR&D SOP",
    "category": "Other"
  },
  {
    "step_id": "1_AFTER_MAKING_PRELIMINARY_EN",
    "procedure": "(1) After making preliminary enquiry or investigation, the IO along\nwith other lady police officer will escort the victim for medical\nexamination",
    "details": "(1) After making preliminary enquiry or investigation, the IO along\nwith other lady police officer will escort the victim for medical\nexamination. (2) The IO shall ensure that the child victim is medically examined at\nthe earliest preferably within twenty-four hours (in accordance with\nSection 164-A Cr.P.C.) at the nearest government hospital .or hospital\nrecognized by the government. (3) In case of a girl child victim, the medical examination shall be\nconducted preferably by a female doctor.",
    "legal_ref": "Section 164-A Cr.P.C.",
    "timeline_hours": 4,
    "source_doc": "Delhi Police SOP",
    "category": "Medical"
  },
  {
    "step_id": "7_THE_SECTION_164_A_CR",
    "procedure": "(7) The section 164-A Cr",
    "details": "(7) The section 164-A Cr.P.C. imposes an obligation on the part of the\n10 to get the victim of rape medically examined within 24 hours. A copy\nof the report of such medical examination should be immediately handed\nover to the Magistrate who recorded the statement of victim u/s\n164Cr.P.C.",
    "legal_ref": "section 164-A Cr.P.C.",
    "timeline_hours": 24,
    "source_doc": "Delhi Police SOP",
    "category": "Medical"
  },
  {
    "step_id": "CASES_REGISTERED_UNDER_POCSO_A",
    "procedure": "Cases registered under POCSO Act shall also be treated as such",
    "details": "Cases registered under POCSO Act shall also be treated as such. Initial Special Report (ISR) should be issued within 24 hours of the registration\nof the case by the ACP without fail and it must reach the DCP office the same\nevening. Thereafter, Continued Special Reports (CSRs) shall be issued every",
    "legal_ref": "POCSO",
    "timeline_hours": 24,
    "source_doc": "Delhi Police SOP",
    "category": "FIR"
  },
  {
    "step_id": "THE_REFRIGERATORS_PROVIDED_TO",
    "procedure": "The refrigerators provided to the police\nstations for the purpose shall be used for preservation of exhibits only\nand not for any other purpose",
    "details": "The refrigerators provided to the police\nstations for the purpose shall be used for preservation of exhibits only\nand not for any other purpose. (2) Investigating Officers shall deposit all the relevant exhibits/\ndocuments for examination with the Forensic Science Laboratory (FSL)\nas early as possible, preferably within 07 days from the date of its\ncollection. Further, in case of biological samples such as blood, semen,",
    "legal_ref": null,
    "timeline_hours": 168,
    "source_doc": "Delhi Police SOP",
    "category": "Medical"
  },
  {
    "step_id": "INVESTIGATION_IN_SUCH_CASES_SH",
    "procedure": "Investigation in such cases shall be closely\nmonitored by the concerned DCP",
    "details": "Investigation in such cases shall be closely\nmonitored by the concerned DCP. (1) The Investigation of offences under sections 376, 376A, 376AB,\n376B, 376C, 376D, 376DA, 376DB or section 376E of the IPC and\nsexual assault cases under POCSO Act shall be completed within 60\ndays from the date of filing of FIR in view of the Criminal Law\n(Amendment) Act, 2018. (2) It should be ensured that pseudonyms are used in place of the\nname of the victim while recording the statement u/s 161 Cr.P.C.",
    "legal_ref": "POCSO",
    "timeline_hours": 1440,
    "source_doc": "Delhi Police SOP",
    "category": "FIR"
  },
  {
    "step_id": "B_DRAFT_CHARGE_SHEET_1_IN_VIE",
    "procedure": "(b) Draft Charge Sheet\n (1) In view of the above provisions, a draft charge-sheet in the sexual\nassault cases mentioned in para (a)(i) above be prepared within 45 days\nwithout fail",
    "details": "(b) Draft Charge Sheet\n (1) In view of the above provisions, a draft charge-sheet in the sexual\nassault cases mentioned in para (a)(i) above be prepared within 45 days\nwithout fail. (2) Inspector (Investigation), SHO and ACP shall personally monitor\nsuch cases and ensure that the draft charge sheet is prepared and put",
    "legal_ref": null,
    "timeline_hours": 1080,
    "source_doc": "Delhi Police SOP",
    "category": "Reporting"
  },
  {
    "step_id": "AS_FAR_AS_POSSIBLE_THE_DCP_SHO",
    "procedure": "As far as possible, the DCP should also\nexamine the charge sheet, depending upon the nature of the case,\nbefore it is put in court",
    "details": "As far as possible, the DCP should also\nexamine the charge sheet, depending upon the nature of the case,\nbefore it is put in court. In case the charge sheet is not filed within 30\ndays, the case should be brought to the notice of the concerned Joint\nCommissioner of Police. (3) In case the accused has been arrested, the Final Report in the\nform of a charge-sheet shall be filed within 60 days without fail.",
    "legal_ref": null,
    "timeline_hours": 720,
    "source_doc": "Delhi Police SOP",
    "category": "Reporting"
  },
  {
    "step_id": "IN_CASE_THE_CHARGE_SHEET_IS_NO",
    "procedure": "In case the charge sheet is not filed within 30\ndays, the case should be brought to the notice of the concerned Joint\nCommissioner of Police",
    "details": "In case the charge sheet is not filed within 30\ndays, the case should be brought to the notice of the concerned Joint\nCommissioner of Police. (3) In case the accused has been arrested, the Final Report in the\nform of a charge-sheet shall be filed within 60 days without fail. Further investigation, if required, shall continue, including arrest of\nthe co-accused, PO proceedings, deposit of exhibits, age-estimation,\netc.",
    "legal_ref": null,
    "timeline_hours": 1440,
    "source_doc": "Delhi Police SOP",
    "category": "Reporting"
  },
  {
    "step_id": "GOVT",
    "procedure": "Govt",
    "details": "Govt. of\nNCT of Delhi & Ors.' had directed that a copy of the FIR involving sexual\nviolence shall be sent to the DSLSA via dedicated NIC e-mail\nsampark.dslsa@gov.in within 24 hours of registration of such FIR to enable\nthe DSLSA to take immediate steps for providing legal aid to the victim as well\nas compensation. The IO and SHO concerned shall assist the D.L.S.A.",
    "legal_ref": null,
    "timeline_hours": 24,
    "source_doc": "Delhi Police SOP",
    "category": "FIR"
  }
]